<a href="https://colab.research.google.com/github/VedJ13/Pandas/blob/main/Pandas_2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## Advanced Pandas

In [2]:
import pandas as pd

### Insert operation

In [29]:
data = {
    "Name": [None, "Bob", "Charlie", "David"],
    "Age": [25, 30, 35, None],
    "City": ["New York", None, "Los Angeles", "Chicago"]
}

df = pd.DataFrame(data)
print(df)

df["Country"] = ["USA", "UK", None, "USA"]
print(df)

df.insert(2, "Salary", [10000, 20000, None, 40000])
print(df)

      Name   Age         City
0     None  25.0     New York
1      Bob  30.0         None
2  Charlie  35.0  Los Angeles
3    David   NaN      Chicago
      Name   Age         City Country
0     None  25.0     New York     USA
1      Bob  30.0         None      UK
2  Charlie  35.0  Los Angeles    None
3    David   NaN      Chicago     USA
      Name   Age   Salary         City Country
0     None  25.0  10000.0     New York     USA
1      Bob  30.0  20000.0         None      UK
2  Charlie  35.0      NaN  Los Angeles    None
3    David   NaN  40000.0      Chicago     USA

### Update Operation

In [9]:
df.loc[0, "Age"] = 12
df["Age"] = df["Age"] + 2
print(df)

      Name  Age  Salary           City Country
0    Alice   14   10000       New York     USA
1      Bob   38   20000  San Francisco      UK
2  Charlie   38   30000    Los Angeles  Canada
3    David   47   40000        Chicago     USA

### Remove data

In [14]:
df.drop(columns=["Country","Salary"], inplace=True)
print(df)

      Name  Age
0    Alice   14
1      Bob   38
2  Charlie   38
3    David   47

### Handling Missing Data

In [30]:
# print(df.isnull())
print(df.isnull().sum())

# df.dropna(axis = 0, inplace=True)
# df.dropna(inplace=True) # This will remove missing data along with rows (axis = 0)/ coulumn (axis = 1)

# df.fillna(0, inplace=True)
df['Age'].fillna(df['Age'].mean(), inplace = True)
print(df)

Name       1
Age        1
Salary     1
City       1
Country    1
dtype: int64
      Name   Age   Salary         City Country
0     None  25.0  10000.0     New York     USA
1      Bob  30.0  20000.0         None      UK
2  Charlie  35.0      NaN  Los Angeles    None
3    David  30.0  40000.0      Chicago     USA

/tmp/ipython-input-30-107240506.py:8: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Age'].fillna(df['Age'].mean(), inplace = True)

### Interpolation

In [33]:
Stock = {
    "Quantity" : [1,2,None,4,None],
    "Price" : [None,200,300,None,500]
}

df = pd.DataFrame(Stock)
print(df)

# df['Quantity'] = df['Quantity'].interpolate(method="linear")
df.interpolate(method="polynomial", order=2, inplace=True)
print(df)

   Quantity  Price
0       1.0    NaN
1       2.0  200.0
2       NaN  300.0
3       4.0    NaN
4       NaN  500.0
   Quantity  Price
0       1.0    NaN
1       2.0  200.0
2       3.0  300.0
3       4.0  400.0
4       NaN  500.0

### Sorting & Aggregation

In [40]:
Stock = {
    "Quantity" : [53,43,46,43],
    "Price" : [131,533,23,350]
}

df = pd.DataFrame(Stock)
print(df)

df.sort_values(by=["Quantity","Price"], ascending = [False,True], inplace = True)
print(df)

avg_price = df["Price"].mean() #Aggregation
print(avg_price)

   Quantity  Price
0        53    131
1        43    533
2        46     23
3        43    350
   Quantity  Price
0        53    131
2        46     23
3        43    350
1        43    533
259.25

### Group By

In [46]:
Stock = {
    "Product" : ["SmartPhone", "Laptop", "Tablet", "TV"],
    "Quantity" : [53,43,46,43],
    "Price" : [131,533,23,350]
}

df = pd.DataFrame(Stock)

grouped = df.groupby("Quantity")["Price"].sum()
grouped = df.groupby(["Quantity","Product"])["Price"].sum()
print(grouped)

Quantity  Product
43        Laptop        533
          TV            350
46        Tablet         23
53        SmartPhone    131
Name: Price, dtype: int64

### Merging & Joining

In [57]:
df_customers = pd.DataFrame({
    "CustomerID": [1, 2, 3, 4],
    "Name": ["Alice", "Bob", "Charlie", "David"]
})

df_orders = pd.DataFrame({
    "OrderID": [101, 102, 103, 104],
    "CustomerID": [1, 2, 5, 6]
})

# merged_df = pd.merge(df_customers, df_orders, on="CustomerID", how="inner")
# merged_df = pd.merge(df_customers, df_orders, on="CustomerID", how="outer")
# merged_df = pd.merge(df_customers, df_orders, on="CustomerID", how="left")
# merged_df = pd.merge(df_customers, df_orders, on="CustomerID", how="right")
merged_df = pd.merge(df_customers, df_orders, how="cross")
print(merged_df)

# Joining or Concatenating

df_customer = pd.DataFrame({
    "CustomerID": [1, 2, 3, 4],
    "Name": ["Alice", "Bob", "Charlie", "David"]
})

df_order = pd.DataFrame({
    "CustomerID": [1, 2, 5, 6],
    "Name": ["Alisa", "Bruce", "Chris", "Dravid"]
})

# df_concate = pd.concat([df_customer, df_order], axis=0, ignore_index=True)
df_concate = pd.concat([df_customer, df_order], axis=1, ignore_index=True)
print(df_concate)

    CustomerID_x     Name  OrderID  CustomerID_y
0              1    Alice      101             1
1              1    Alice      102             2
2              1    Alice      103             5
3              1    Alice      104             6
4              2      Bob      101             1
5              2      Bob      102             2
6              2      Bob      103             5
7              2      Bob      104             6
8              3  Charlie      101             1
9              3  Charlie      102             2
10             3  Charlie      103             5
11             3  Charlie      104             6
12             4    David      101             1
13             4    David      102             2
14             4    David      103             5
15             4    David      104             6
   0        1  2       3
0  1    Alice  1   Alisa
1  2      Bob  2   Bruce
2  3  Charlie  5   Chris
3  4    David  6  Dravid